// Задача 1: Напишите программу, которая принимает
// на вход число и проверяет, кратно ли оно
// одновременно 7 и 23

// int num_1 = 7;
// int num_2 = 23;

// Console.Write("Введите число: ");
// int user_num = Convert.ToInt32(Console.ReadLine());

// if ((user_num % num_1 == 0) && (user_num % num_2 == 0))
// {
//     Console.WriteLine($"Число {user_num} кратно");
// }
// else
// {
//     Console.WriteLine($"Число {user_num} не кратно");
// }


// Задача 2: Напишите программу, которая принимает
// на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠
// 0 и выдаёт номер координатной четверти плоскости,
// в которой находится эта точка.

// Console.Write("Введите координату X: ");
// int x = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите координату Y: ");
// int y = Convert.ToInt32(Console.ReadLine());

// if (x == 0 || y == 0)
// {
//     Console.WriteLine("Координата не должна равняться 0");
// }
// else
// {
//     if (x > 0 && y > 0)
//     {
//         Console.WriteLine("1");
//     }
//     if (x > 0 && y < 0)
//     {
//         Console.WriteLine("2");
//     }
//     if (x < 0 && y < 0)
//     {
//         Console.WriteLine("3");
//     }
//     if (x < 0 && y > 0)
//     {
//         Console.WriteLine("4");
//     }
// }

