// Задача 1: Напишите программу, которая принимает
// на вход число и проверяет, кратно ли оно
// одновременно 7 и 23

// int num_1 = 7;
// int num_2 = 23;

// Console.Write("Введите число: ");
// int user_num = Convert.ToInt32(Console.ReadLine());

// if ((user_num % num_1 == 0) && (user_num % num_2 == 0))
// {
//     Console.WriteLine($"Число {user_num} кратно");
// }
// else
// {
//     Console.WriteLine($"Число {user_num} не кратно");
// }