// Задача 1: Напишите программу, которая принимает
// на вход число и проверяет, кратно ли оно
// одновременно 7 и 23

int num_1 = 7;
int num_2 = 23;

Console.WriteLine("Введите число: ");
